app/controllers/users_controller.rb

  def create
  	@user = User.create(user_params)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "alex the soft"], ["created_at", "2019-07-01 00:34:08.171163"], ["updated_at", "2019-07-01 00:34:08.171163"]]

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "alex the weak"], ["updated_at", "2019-07-01 01:01:39.969758"], ["id", 4]]