app/models/character.rb

  def self.overall_sort
    self.all.sort_by {|character| character.overall }
---
SELECT "characters".* FROM "characters"